## Appending and concatenating Series

### .append() method

In [1]:
import pandas as pd
hp = pd.Series(['Harry','Ron','Hermione'])
lotr = pd.Series(['Frodo', 'Sam', 'Aragorn'])

In [2]:
total = hp.append(lotr)
print(total)

0       Harry
1         Ron
2    Hermione
0       Frodo
1         Sam
2     Aragorn
dtype: object

In [3]:
print(total.index)

Int64Index([0, 1, 2, 0, 1, 2], dtype='int64')

In [4]:
total.loc[1]

1    Ron
1    Sam
dtype: object

In [5]:
new_total = total.reset_index(drop=True) # gives an unique index number to all rows
print(new_total)

0       Harry
1         Ron
2    Hermione
3       Frodo
4         Sam
5     Aragorn
dtype: object

### .concat()

In [6]:
total = pd.concat([hp,lotr])
print(total)

0       Harry
1         Ron
2    Hermione
0       Frodo
1         Sam
2     Aragorn
dtype: object

In [7]:
new_total = pd.concat([hp,lotr],ignore_index = True)
print(new_total)

0       Harry
1         Ron
2    Hermione
3       Frodo
4         Sam
5     Aragorn
dtype: object

## Appending and concatenating DataFrames

In [9]:
gold = pd.read_csv('Gold.csv', index_col = 0)
silver = pd.read_csv('Silver.csv', index_col = 0)

In [27]:
gold.append(silver, ignore_index = True)

                  Country   Total
0           United States  2088.0
1            Soviet Union   838.0
2          United Kingdom   498.0
3                  France   378.0
4                 Germany   407.0
..                    ...     ...
271               Senegal     1.0
272                 Sudan     1.0
273                 Tonga     1.0
274               Burundi     NaN
275  United Arab Emirates     NaN

[276 rows x 2 columns]

In [26]:
pd.concat([gold, silver],axis = 1) # axis = 1 stacks dataframes horizontally

                  Country   Total               Country   Total
NOC
USA         United States  2088.0         United States  1195.0
URS          Soviet Union   838.0          Soviet Union   627.0
GBR        United Kingdom   498.0        United Kingdom   591.0
FRA                France   378.0                France   461.0
GER               Germany   407.0               Germany   350.0
..                    ...     ...                   ...     ...
SEN               Senegal     NaN               Senegal     1.0
SUD                 Sudan     NaN                 Sudan     1.0
TGA                 Tonga     NaN                 Tonga     1.0
BDI               Burundi     1.0               Burundi     NaN
UAE  United Arab Emirates     1.0  United Arab Emirates     NaN

[138 rows x 4 columns]